---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetCellCalculatedValue(System.Int32)
source: html/974af8b8-9e02-ce8d-6b95-16fb8deb7fb1.htm
---
# Autodesk.Revit.DB.TableSectionData.GetCellCalculatedValue Method

Gets the calculated value for the specified column

## Syntax (C#)
```csharp
public TableCellCalculatedValueData GetCellCalculatedValue(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.